app/controllers/picture_controller.rb

SELECT * FROM `pictures` WHERE (status>0 and category=1) ORDER BY id desc LIMIT 0, 7
SELECT count(`pictures`.id) AS count_id FROM `pictures` WHERE (status>0 and category=1)
---
  def index
    params[:id] ||= 1
    @category = params[:id].to_i
    params[:page] ||= 1
    params[:per_page] ||= 7
    offset = ((params[:page].to_i) - 1 ) * (params[:per_page].to_i)
    @pictures = Picture.all(@category,params[:per_page],offset)