app/controllers/post_controller.rb

SELECT * FROM `posts` WHERE (status>0 and category > 2) ORDER BY is_top desc, id desc LIMIT 0, 20
---
  def index
    params[:id] ||= 0
    @category = params[:id].to_i

    total_count = Post.posts_count(@category)
    limit, offset = process_paginate(total_count, 20)
    @posts = Post.all(@category,limit, offset)